export default function About() {

  console.log("from about")
  return (
    <p className="text-lg leading-relaxed">
      شخصية نشيطة وطموحة مع نظرة ثاقبه حاملة لمؤهلات علمية وعملية حيث تنخرط في
      جميع الاعمال الفردية والاجتماعية تحب التميز وقيادة زملائها الى نجاح شعارها
      فريق متميز لوطنٍ واعد وليس هذا فحسب فإن الظاعن تتميز بالذكاء والحدة وتجيد
      المخاطبة باللغة الأم واللغة الإنجليزية بطلاقة ومنطقية فهي حاصلة على درجة
      عالية من المؤهلات العلمية من المملكة المتحدة مما جعلها شخصية ابتكارية،
      باحثة ومحللة جديرة والذي لفت انتباه عميد كلية ساندهيرست العسكرية الملكية
      ومنحها وسام التميز.
    </p>
  );
}
