"use client";

import { LayoutGroup, motion } from "framer-motion";
import ExperienceCard from "../ExperianceCard";

export default function Experiences() {
  const experiences = [
    {
      date: "2009 – لحد الآن",
      title: "بلجريف للاستشارات",
      jobDescription: "مدير ادارة المشروعات",
      details: [
        "التخطيط لتنفيذ وتفعيل برنامج الخدمات الامنية الجديدة والاولى من نوعها لحكومة المملكة المتحدة بما في ذلك: وزارة الدفاع (MOD)، وزارة العدل (MOJ)، وزارة العمل (DWP12)، وزارة الصحة (NHS)، وزارة الداخلية (Home Office)، وكالة قوة الحدود والهجرة (Border Force)، الوكالة الوطنية للجريمة والإرهاب (NCA)",
      ],
    },
    {
      date: "2008 - 2009",
      title: "مجموعة إن هيلث جروب",
      jobDescription: "مدير التسويق",
      details: [
        "المسؤولة عن رفع جميع التقارير و البحوث الإستراتيجية والمراسلات إلى مدير التسويق الاقليمــــي للشركة.",
        "المسؤولة عن وضع خطة الاتصال السنوية بما في ذلك تحديد الأهداف والاستراتيجيات لكسب العملاء والاحتفاظ بهم و العمل على وزيادة التوسعة.",
        "إجراء جميع البحوث وخلق هوية العلامة التجارية.",
        "وضع وتنفيذ حملة تسويقية في التلفزيون والصحافة المكتوبة والالكترونية",
        "التسويق الفيروسي (Viral Marketing) بعائد هائل على الاستثمار للعلامات التجارية المتنافسة.",
      ],
    },
    {
      date: "2001 - 2005",
      title: "سفــارة مملكــة البحريــن - لنــدن",
      jobDescription: "مدير المكتب الإداري/ مساعد المستشار",
      details: [
        "العمل في قسم الإدارة / التأشيرات بالسفارة والتعامل مع طلبات التأشيرات والتنسيق بين الأقسام القنصلية المختلفة والدبلوماسيين",
        "إدارة البروتوكولات والقضايا السياسية والثنائية ومتعددة الأطراف",
        "تخاذ الترتيبات اللازمة لبرامج زيارات الدول والزيارات الرسمية لرؤساء الدول الأجنبية ورؤساء الحكومات في المملكة المتحدة والخارج.",
        "التعامل مع الشؤون الإدارية والقنصلية للسفارة",
        "التواصل مع السلطات البحرينية بخصوص مسائل الأمن والبروتوكولات والشؤون الإدارية والقنصليّة",
        "متابعة وضع الأجانب في البحرين من حيث الأمن والقواعد واللوائح والممارسات المحلية وتقديم تقارير بها",
        "متابعة الشؤون القانونية في البحرين والقوانين ذات الصلة مثل قوانين العمالة والشؤون الاجتماعية والأحوال المدنية وتقديم تقارير بها.",
        "متابعة الحقيبة الدبلوماسية والتنسيق بين الجهات الحكومة البحرينية والدولية.",
        "تحمل مسؤولية الحفاظ على ممتلكات السفارة، مثل أعمال الصيانة وأعمال الترميم وغيرها من الأعمال بما في ذلك الإشراف على موظفي الصيانة.",
        "ترجمة الوثائق وتقديم التفسيرات المهنية.",
        "متابعة الصحف اليومية العربية وتقديم تقارير بها بالتعاون مع المستشار السياسي",
      ],
    },
  ];

  const experiencesLength = experiences.length;

  return (
    <LayoutGroup>
      <div className="grid grid-cols-[1fr_auto_1fr] gap-8 flow">
        {/* ############### */}
        {experiences.map((ex, idx, arr) => {
          const isOdd = (idx + 1) % 2 !== 0;
          return <ExperienceCard key={ex.date} ex={ex} isOdd={isOdd} />;
        })}
        {/* ############### */}
        <motion.div
          layout="preserve-aspect"
          style={{
            gridRow: `1/${experiencesLength + 1}`,
          }}
          className={`-z-50 col-start-2 w-[2px] bg-gray-200`}
        />
      </div>
    </LayoutGroup>
  );
}
